[
    {
        "id": 1,
        "title": "What It Means To Be A Gentleman Today",
        "content": "You hear it everywhere these days: the term “gent” or “gentleman” has become ubiquitous in men’s magazines, blogs, and conversations. Videos welcome “gentlemen” and everybody seems to use the word for a wide range of men.<br/><br/> A reader recently took us to task by saying that anything other than the traditional definition of a gentleman is a disappointment. Another claimed that a gentleman must have staff and would never cook for himself.<br/><br/>We couldn’t disagree more – the definition of a gentleman has changed and for the better. Prince Phillip, a textbook “gentleman” of wealth and position, is also famous for his potty mouth and racist gaffes. Are these gentlemanly behaviors? Certainly not.<br/><br/>Since the definition of a gentleman is so fundamental to what the Gentleman’s Gazette is, we thought it was time to outline how we see the gentleman today.<br/><br/><h3>The Original Gentleman</h3><br/>A hundred years ago, a gentleman was a man of high social position and wealth. Even today dictionaries still retain this definition, as well as several others:<br/><ol><li>A chivalrous, courteous, or honorable man.</li><li>A polite or formal way of referring to a man.</li><li>A man of noble birth attached to a royal household</li><li>A man of good social position, especially one of wealth and leisure</li><li>A courteous title for a male fellow member of the House of Commons or the House of Representatives</li></ol>",
        "contentForShortBlog": "You hear it everywhere these days: the term “gent” or “gentleman” has become ubiquitous in men’s magazines, blogs, and conversations.Videos welcome “gentlemen” and everybody seems to use the word for...",
        "images": {
            "large": "img/blog-1-veca.png",
            "small": "img/blog-1-manja.png"
        },
        "authorId": 1,
        "genderId": 1,
        "createdAt": "01-13-2023",
        "viewsCount": 4748,
        "likesCount": 641,
        "tags": [
            "men",
            "gentleman",
            "clothes"
        ]
    },
    {
        "id": 2,
        "title": "Best Winter Snow Boots for Women - 2022",
        "content": "Winter 2021 is officially here! And with winter time comes rain, ice, slush, snowy city streets, and maybe even blizzards, if you're lucky! Whether you're heading to the mountains for a weekend ski trip or just trying to make it from point A to B without slipping and sliding, you're going to need a pair of decent winter boots.<br/><br/>Lucky for you, here at My Fashion Tribu we have a whole array of winter boots perfect for the unprecedented weather to come. Take a scroll through our favourite options.<br/><br/><ol><li>Sorel Explorer II Joan Cozy Winter boots in Cream<br/><br/>The warmth of a winter boot meets the fit of a sneaker with the stylish Explorer II Joan. The Joan is crafted from a combination of soft waterproof leather-and-suede, featuring a faux fur shearling outer, and a moulded EVA footbed for added support and comfort. This stylish winter boot will provide you with unprecedented grip and comfort allowing you to take on snowy days in the city or weekend mountain hikes with no slipping!<br/><br/></li><li>Sorel WHITNEY™ II lace up boots in the colour stone<br/><br/>The Whitney™ has a hint of an old-school sporty style trainer, mixed with a practical winter boot. Featuring lace up detailing, faux fur lining providing utmost comfort and has a non-slip rubber sole for grip. Conquer the snow, ice and slush in the Sorel Whitney which are 100% waterproof ensuring ultimate comfort and cosiness whilst your exploring the snowy mountains or running errands in the city!<br/><br/></li><li>INUIKII Curly Rock sneaker in Multi Cream<br/><br/>Here we have the statement INUIKII Curly Rock Sneaker boot in cream, this style is super bold and edgy. The sneaker style combines the idea of a simpler and slimmer boot mixed with an athletic, streamlined structure of a trainer. This style in particular has stud detailing around the lower part of the boot, is crafted from the finest wool which protrudes from the lower part of the shoe to the ankle. Leather and suede side panels and black contrasting lacing. They have an anti-slip rubber sole and water resistant properties which makes them a great Autumn Winter footwear choice particularly if you have a weekend ski trip booked and plan on adventures in the snow.</li>",
        "contentForShortBlog": "Winter 2021 is officially here! And with winter time comes rain, ice, slush, snowy city streets, and maybe even blizzards, if you're lucky! Whether you're heading to the mountains for a weekend ski trip or just trying...",
        "images": {
            "large": "img/blog-2-veca.png",
            "small": "img/blog-2-manja.png"
        },
        "authorId": 3,
        "genderId": 2,
        "createdAt": "12-15-2022",
        "viewsCount": 2955,
        "likesCount": 988,
        "tags": [
            "women",
            "boots",
            "snow",
            "winter",
            "fashion",
            "outfit"
        ]
    },
    {
        "id": 3,
        "title": "Is It Better To Run In Shorts Or Leggings?",
        "content": "There are many different schools of thought when it comes to what to wear while running. Some people prefer to wear shorts, while others prefer leggings. So, which is the better option?<br/><br/><h3>SHORTS VS. LEGGINGS: WHAT TO WEAR IN DIFFERENT WEATHER CONDITIONS?</h3>When making this choice, there are a few factors to take into account. First, think about the weather. If it's cold outside, you'll probably want to opt for leggings. They'll keep your legs warm and help you avoid any potential injuries from the cold weather.<br/><br/>If you're running in hot weather, on the other hand, shorts maybe the better option. They'll help you stay cool and won't cause you to overheat.<br/><br/>Another thing to consider is your preference. Simply said, some people find shorts more comfortable than leggings. There's no right or wrong answer here - it's all about what you're most comfortable in.<br/><br/>So, which is better - shorts or leggings? There's no one-size-fits-all answer to this question. Everything is dependent on the climate and your preferences. Whatever you choose, make sure you're comfortable and enjoy your run!<br/><br/><h3>THE PROS AND CONS OF BOTH THE OPTIONS</h3><br/><br/>This question cannot be answered with certainty because it is based on individual preference. Leggings are preferred by some runners, while shorts are more comfortable for others. The choice of what is most comfortable for an individual is ultimately up to them. Here's a look at the pros and cons of each option to help you make the best decision for your own running.",
        "contentForShortBlog": "There are many different schools of thought when it comes to what to wear while running. Some people prefer to wear shorts, while others prefer leggings. So, which is the better option?...",
        "images": {
            "large": "img/blog-3-veca.png",
            "small": "img/blog-3-manja.png"
        },
        "authorId": 2,
        "genderId": 3,
        "createdAt": "11-28-2022",
        "viewsCount": 788,
        "likesCount": 266,
        "tags": [
            "sports",
            "running",
            "leggings",
            "shorts"
        ]
    },
    {
        "id": 4,
        "title": "Guide – Sole types for shoes and boots",
        "content": "When it comes to quality footwear, there’s a lot more to it than just leather soles or rubber soles. The various types within each category are huge, all with various specs and preferences. Here’s a substantial guide to all the most common types of soles for quality shoes and boots.<br/><br/><h3>Single leather soles</h3><br/><br/>Still the most common form of soles on a pair of quality shoes, even if rubber versions takes over more and more. A single leather sole on a Goodyear welted shoe is sewn onto the welt, so if you look from the side you see two layers of leather. The same is true of a Blake / rapid stitched shoe, where the top layer of leather instead of the welt is a thinner midsole, while a welted shoe has only the single leather sole.<br/><br/>Leather soles come in a variety of grades, but for better footwear which is covered here on Shoegazing, there are usually three used: prime, super prime, and oak barked. To summarise these, one have to generalise, since there’s not really any set requirements as it was more off back in the days.<br/><br/>Prime and Super prime soles are made in much the same way, using a fully vegetable tanning or combination-tanning process that takes a number of weeks, up to a couple of months. The difference in grading is mainly in how good the leather quality is, with finer leather with denser grain being classed as Super prime. Prime soles are generally found on shoes in the €150-€300 price range, Super prime on shoes between €300-€600, give or take.<br/><br/><h3>Double leather soles</h3><br/><br/>Just as it sounds, two layers of sole leather are simply used instead of one (for double rubber soles, there’s normally a leather midsole used). The sole is thicker and therefore more durable and insulates better against the cold, but it also makes for a slightly clumsier and stiffer shoe. Most common on more casual shoes or on boots. There are also triple-soled shoes, but these are rare, and given that they are said to take a year or so of use to break in properly, they are not very practical. For RTW, it’s common to use cheaper leather for the midsoles.",
        "contentForShortBlog": "When it comes to quality footwear, there’s a lot more to it than just leather soles or rubber soles. The various types within each category are huge, all with various specs and preferences...",
        "images": {
            "large": "img/blog-4-veca.png",
            "small": "img/blog-4-manja.png"
        },
        "authorId": 1,
        "genderId": 1,
        "createdAt": "09-05-2022",
        "viewsCount": 1956,
        "likesCount": 1002,
        "tags": [
            "men",
            "shoes",
            "boots",
            "sole",
            "rubber",
            "leather"
        ]
    },
    {
        "id": 5,
        "title": "4 Ways To Look Stylish While Working Out",
        "content": "Working out has been a trend in the past few years, with all celebrities and popular faces including it in their routine. Following them and their lifestyle, everyone wants to add a gym as a daily routine to fit in. Being in a trend that affects your whole lifestyle includes so much such as diet, schedule, physical changes and so much that needs to be coped up with.<br/><br/>One of these is your gym wear, the hot workout look! Since that is so much hype, even online sportswear shops and brands are working in bringing in the glam for the gym.<br/><br/>Here are some simple tips for you to notch up your fitness style.<br/><br/><ol><li><h3>PAIR UP THE BASICS</h3>You can never get short outfits if you know how to use basics. You can get a number of fits pairing leggings with almost every top and designer sports bras, it will no doubt be a hit. Similarly, with the sports bra, it goes fine with almost every bottom you own, you can throw a loose tank top with a sports bra in with sweats, it works just fine for a abs or upper body workout.<br/><br/>One thing while pairing up the fits you need to be careful about is the utility. You need to be aware of the routine for the day to know you made the right choice for the time. Since the most important feature of workout clothes has to be their utility, you cannot rule it out.<br/><br/>For example, if you are up for a thigh routine, go for shorts, but mind the waist, for abs sports bras will do the best.</li><br/><br/><li><h3>COLOR PALETTE</h3><br/><br/>Every place has a mood, and that is reflected with a particular color palette. The gym is more about basic and strong shades, similar to the patterns. Need to give your base of the outfit a basic color, not if for the whole fit. Like if you are on high waist leggings and crop tops, go for a dark shade with leggings and a lighter one for the top. In majorly we make a pair with lower covering the larger half of our body. That’s because securing your waist with high waists is quite important and also supports your abdomen muscles, and gives you a better shape. Thus pick darker shades for the lower you buy and have a wider range always.</li><br/><br/><li><h3>THE FIT</h3><br/><br/>Mind the size and fit according to your body. One of the most flawed notions about activewear is that they are supposed to be tight. Well, that’s just a false statement but can even harm you in many ways. Fitness yoga wear or activewear or any workout gear for sure needs to be fit but not tight. Every single one of them has its utility and thus the size and fit need to be taken care of. Most activewear apparels are designed to support your muscles, thus fitting you with the skin, others are slightly loose to let the skin breathe and pass the air. Also, every single piece of clothing is designed to fit in a manner, otherwise will never suit the body. To use it in the right way and to bring out the perfect look, it’s important that you know the size and chooses the right fit.</li></ol>",
        "contentForShortBlog": "Working out has been a trend in the past few years, with all celebrities and popular faces including it in their routine. Following them and their lifestyle, everyone wants to add a gym...",
        "images": {
            "large": "img/blog-5-veca.png",
            "small": "img/blog-5-manja.png"
        },
        "authorId": 8,
        "genderId": 2,
        "createdAt": "07-17-2022",
        "viewsCount": 8744,
        "likesCount": 6320,
        "tags": [
            "women",
            "fitness",
            "gym",
            "workout",
            "style"
        ]
    },
    {
        "id": 6,
        "title": "What To Wear For Valentine’s Day 2022: Outfit Ideas",
        "content": "Valentine’s Day is only a month away and I can hardly believe it! I’ve spent the last few weeks refreshing and resetting for the new year. Now I’m excited and ready to have a small holiday to look forward to. While I don’t love every aspect of Valentine’s Day (I’m looking at you, prix fixe menus and cheesy cards), I’ll take any excuse to get dressed up.<br/><br/><hr><h3>What should I wear for Valentine’s Day 2023?</h3><br/><br/>While this question is very vague, I think the best response is to wear whatever makes you feel good. If you’re like me and getting glammed up in fancy dresses brings you joy, take advantage of Valentine’s Day and go all out (I’ll be wearing this frock for the occasion)! If you’re more comfortable wearing a pair of jeans and a festive sweater, go for it! There is no right or wrong answer and today I am providing lots of options based on whatever your plans may be.<br/><br/><h3>What colors do you wear on Valentine’s Day?</h3><br/><br/>I think by now almost everyone knows that red and pink are the most commonly worn colors for Valentine’s Day. Not surprisingly, this also happens to be one of my all-time favorite color combinations, so I never hesitate to go over the top! Personally, I’m not afraid to mix and match red and pink or wear a monochromatic head-to-toe red look (as witnessed above). But, you can complete a more subdued look with a touch of color from a pair of bright tights, a purse that pops, or even some festive earrings.<br/><br/><h3>How should I do my hair and makeup for Valentine’s Day?</h3><br/><br/>No matter what your plans are, it can be fun to put a little extra effort into your hair and makeup. I’ve previously shared a soft, romantic beauty look for Valentine’s Day that would work for all occasions. As for my hair, you will most likely find it in my favorite sleek bun. This chic and minimal hairstyle compliments just about any outfit I dream up!<br/><br/><h3>What should I wear for a casual Valentine’s Day outfit?</h3><br/><br/>If you don’t plan to dress up this year, there are still plenty of ways to look cute and festive. You could wear this under $50 fun heart sweater and jeans to a casual gathering with friends or this easy sweater dress that looks great with a pair of casual boots. Additionally, it can be nice to stay comfy in Valentine’s pajamas at home – I am linking to lots of options below so keep scrolling.",
        "contentForShortBlog": "Valentine’s Day is only a month away and I can hardly believe it! I’ve spent the last few weeks refreshing and resetting for the new year. Now I’m excited and ready to have a small holiday...",
        "images": {
            "large": "img/blog-6-veca.png",
            "small": "img/blog-6-manja.png"
        },
        "authorId": 3,
        "genderId": 2,
        "createdAt": "02-01-2022",
        "viewsCount": 9770,
        "likesCount": 8331,
        "tags": [
            "women",
            "fashion",
            "style",
            "valentine",
            "outfit"
        ]
    }

]